[DET-001 Multiple Failed Logons]
search = index=endpoint sourcetype=winsec:json EventID=4625 | stats count by AccountName, IpAddress | where count >= 5
cron_schedule = */5 * * * *
alert_type = always
alert.severity = 4

[DET-002 Encoded PowerShell Execution]
search = index=endpoint sourcetype=sysmon:json EventID=1 Image="*powershell*" (CommandLine="*-enc*" OR CommandLine="*FromBase64String*")
cron_schedule = */5 * * * *
alert_type = always
alert.severity = 5

[DET-003 LSASS Access Attempt]
search = index=endpoint sourcetype=sysmon:json EventID=10 TargetImage="*lsass.exe*"
cron_schedule = */5 * * * *
alert_type = always
alert.severity = 6

[DET-010 IAM Privilege Escalation Policy Change]
search = index=cloud sourcetype=aws:cloudtrail:json eventSource=iam.amazonaws.com (eventName=AttachUserPolicy OR eventName=PutUserPolicy OR eventName=AttachRolePolicy)
cron_schedule = */10 * * * *
alert_type = always
alert.severity = 5
